In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

ModuleNotFoundError: No module named 'sql'

# Create database named tutorial

In [4]:
%%sql
create database if not exists tutorial;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [3]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[('customers',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('tutorial',),
 ('uber',),
 ('world',)]

# To use a database

In [9]:
%%sql
use tutorial

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

# Creates a table crud

In [7]:
%%sql
drop table if exists crud;
create table crud(sno int , name varchar(100));

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [8]:
%%sql
select * from demo

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1,)]

# Insert values into table (crud)

In [30]:
%%sql
insert into crud (sno,name) values (2,'Bharathi');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

# Show values into table (crud)

In [31]:
%%sql
select * from crud;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 'Manoj'), (3, 'Bharathi'), (2, 'Bharathi')]

# Update values into the table (crud)

In [33]:
%%sql

update crud set name='sound wave', sno=2 where sno=3;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [34]:
%%sql
select * from crud;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 'Manoj'), (2, 'sound wave'), (2, 'Bharathi')]

# Deletes specific values in the table crud

In [35]:
%%sql
delete from crud where sno=2 and name='Bharathi';

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [36]:
%%sql
select * from crud;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'Manoj'), (2, 'sound wave')]

# Deletes all the values in the table crud

In [37]:
%%sql
truncate table crud;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

Deletes the table crud

In [38]:
%%sql

drop table crud;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [39]:
%%sql
select * from crud;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'test.test' doesn't exist
[SQL: select * from test;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [8]:
%%sql

CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name  VARCHAR(50) NOT NULL,
    last_name   VARCHAR(50) NOT NULL,
    hire_date   DATE NOT NULL,
    salary      DECIMAL(10,2)

);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'employees' already exists
[SQL: CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name  VARCHAR(50) NOT NULL,
    last_name   VARCHAR(50) NOT NULL,
    hire_date   DATE NOT NULL,
    salary      DECIMAL(10,2)

);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [49]:
%%sql
-- Inserting synthetic data into the employees table
INSERT INTO employees (employee_id, first_name, last_name, hire_date, salary) VALUES 
(1, 'John', 'Doe', '2023-01-15', 50000.00),
(2, 'Jane', 'Smith', '2022-12-01', 60000.00),
(3, 'Michael', 'Brown', '2021-08-23', 70000.00),
(4, 'Emily', 'Johnson', '2020-03-17', 80000.00),
(5, 'Chris', 'Davis', '2019-11-11', 55000.00);

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[]

# CTAS

In [9]:
%%sql
CREATE TABLE high_paid_employees AS
SELECT
    employee_id,
    first_name,
    last_name,
    salary
FROM employees
WHERE salary > 60000;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'high_paid_employees' already exists
[SQL: CREATE TABLE high_paid_employees AS
SELECT
    employee_id,
    first_name,
    last_name,
    salary
FROM employees
WHERE salary > 60000;]
(Background on this error at: https://sqlalche.me/e/20/f405)

# Temporary table (created while execution and deleted after execution)

In [10]:
%%sql

CREATE TEMPORARY TABLE temp_high_paid_employees (
    employee_id INT,
    salary DECIMAL(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [11]:
%%sql
drop table temp_high_paid_employees;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [12]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('demo',), ('employees',), ('high_paid_employees',)]

In [13]:
%%sql

CREATE TEMPORARY TABLE temp_high_paid_employees (
    employee_id INT,
    salary DECIMAL(10,2)
);
INSERT INTO temp_high_paid_employees 
    SELECT
    employee_id,
    salary
FROM employees
WHERE salary > 60000;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
2 rows affected.

[]

In [14]:
%%sql
select * from temp_high_paid_employees;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(3, Decimal('70000.00')), (4, Decimal('80000.00'))]

# CTE (Common Table Expressin) more like a function for database temporary storage of data

In [17]:
%%sql
WITH high_salary_cte AS (
    SELECT employee_id,first_name,last_name,salary
    FROM employees
    WHERE salary > 7000
)
CREATE TABLE high_salary_employees_via_cte
SELECT * FROM high_salary_cte;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'CREATE TABLE high_salary_employees_via_cte,
SELECT * FROM high_salary_cte' at line 6
[SQL: WITH high_salary_cte AS (
    SELECT employee_id,first_name,last_name,salary
    FROM employees
    WHERE salary > 7000
)
CREATE TABLE high_salary_employees_via_cte,
SELECT * FROM high_salary_cte;]
(Background on this error at: https://sqlalche.me/e/20/f405)